app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-03-01 14:43:01.031642"], ["updated_at", "2021-03-01 14:43:01.031642"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @article = Article.find(params[:id])